# Notes
# Задание: Создание программы, которая позволяет ввести заметку о БПЛА и сохранить ее в текстовом файле. Пользователь должен также иметь возможность просматривать ранее сохраненные заметки. Инструкция: Шаг 1. Напишите программу, которая запрашивает ввод текста для заметки о БПЛА (могут содержать информацию о моделях, характеристиках, опыте использования и т.д.) Шаг 2. Создайте текстовый файл, в который будет сохраняться каждая заметка. Каждая новая заметка должна быть сохранена в новой строке с указанием времени создания. Шаг 3.Добавьте возможность просмотра ранее сохраненных заметок. Шаг 4. Создайте текстовое меню, которое позволит выбрать опцию ввода новой заметки, просмотра ранее сохраненных заметок или завершения работы программы.  Шаг 5. Добавьте опцию завершения работы программы. Примечания: Убедитесь, что программа обрабатывает возможные ошибки, такие как отсутствие файла для хранения заметок.

from datetime import datetime
# Создание заметки
def create_note():
    # Вводим текст заметки
    note_text = input("Введите информацию о БПЛА( модель, характеристики, опыт использования и т.д.): ")
    # Открываем файл
    with open("bpla.txt", "a", encoding="utf-8") as file:
        # Записываем заметку в файл с указанием времени написания
        time=datetime.now()
        file.write(note_text + ''+ '--Дата и время заметки: ' + '' + f"{time.day}.{time.month}.{time.year} {time.hour}:{time.minute}:{time.second}"+'\n')
    # Вывод
    print("Заметка о БПЛА  успешно сохранена")

# Просматривать заметку
def view_notes():
    # Пробуем открыть заметки
    try:
        with open("bpla.txt", "r", encoding="utf-8") as file:
            # Записываем заметки
            notes = file.readlines()
            #если заметок еще не было
            if not notes:
                print("Заметок пока нет")
            else:
                print("Список заметок о БПЛА:\n")
                #Добавляем к заметкам при выводе нумерацию с 1
                for idx in range(1, len(notes) + 1):
                    note = notes[idx - 1].strip()
                    print(f"{idx}.{note}")
    #Если файл с заметкой не найден
    except FileNotFoundError:
        print("Файл с заметками не найден. Создайте новую заметку")

# Главное меню
def main_menu():
    while True:
        print("\n===Меню===")
        print("1. Создание заметки")
        print("2. Обзор заметок")
        print("0. Выход")
        choice = input("Выберите опцию (от 0 до 2): ")
        if choice == '1':
            create_note()
        elif choice == '2':
            view_notes()

        elif choice == '0':
            print("До свидания!")
            break
        else:
            print("Некорректный ввод! Введите от 0 до 2.")

main_menu()
